files/pchinen.el

(message " ===============================================  Inicialização das Configurações  ================================================")

(require 'init-customFunctions)

(require 'init-keyBinding)

(require 'init-basicConfig)

(require 'init-backup)

(require 'init-bookmark)

(require 'init-history)

(require 'init-firstInit)

(require 'init-themes)

(require 'init-filesMode)

(require 'init-hooks)

(require 'init-company)

(require 'init-calcmode)

(require 'init-dired)

(require 'init-expandRegion)

(require 'init-flycheck)

(require 'init-helm)

(require 'init-helmSwoop)

(require 'init-helmDescribeKey)

(require 'init-keyfreq)

(require 'init-magit)

(require 'init-multipleCursor)

(require 'init-nyanCat)

(require 'init-orgmode)

(require 'init-regex)

(require 'init-yasnippet)

(message " ===============================================  Fim das Configurações  ================================================")
